waveshareteam/ESP32-S3-Touch-LCD-5/examples/ESP-IDF/03_SD_Test/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
CONFIG_SPIRAM_RODATA=y
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

CONFIG_EXAMPLE_PIN_MOSI=11
CONFIG_EXAMPLE_PIN_MISO=13
CONFIG_EXAMPLE_PIN_CLK=12
CONFIG_EXAMPLE_PIN_CS=-1

CONFIG_I2C_MASTER_SCL=9
CONFIG_I2C_MASTER_SDA=8